# Sub Code
import bpy, os, sys, subprocess
# Get File Path
script_path = bpy.path.abspath(bpy.context.space_data.text.filepath)
script_dir = os.path.dirname(script_path)
# Get Git Root
git_root = subprocess.run(
    ["git", "-C", script_dir, "rev-parse", "--show-toplevel"],
    stdout=subprocess.PIPE, text=True
).stdout.strip()
# Add the parent directory of the root to sys.path
if git_root and git_root not in sys.path:
    sys.path.append(git_root)
# Common Setting
import Common.common_top as common_top
from Common.common_top import *
#========================================================================================
# ==================================================================
# = Pre Process
# ==================================================================
modules = common_top.import_submodules(f"Assets.mdl.SAMPLE_MODEL") 
parts = common_top.import_submodules("Assets.parts")

globals().update(modules)

# =====================================================
# UV展開
# =====================================================
def sukima_logo_uv_unwrap(
    sukima_logo=glb.glb_defs.sukima_logo
):
    if (mm_cm_lib.glb_exist_obj_chk(obj_list=[sukima_logo], EXIST_FLAG_DICT=glb.glb_defs.EXIST_FLAG_DICT)):
        # ビューへ切り替え
        mdl_cm_lib.change_preview(key="MATERIAL")
        # Mode切り替え
        bpy.ops.object.mode_set(mode='OBJECT')

        # ----------------------------------
        # オブジェクト全適用
        # ----------------------------------
        object_list=[sukima_logo]
        # 全適用
        # オブジェクト位置, サイズ, 回転, 中心点初期化
        for i in range(len(object_list)):
            mdl_cm_lib.initialize_transform_apply(
                object_name_list=[object_list[i]]
            )
        
        obj_name=sukima_logo
        # ----------------------------------
        # シーム(切れ目を入れる)
        # ----------------------------------
        # アクティブオブジェクト
        mdl_cm_lib.active_object_select(object_name_list=[obj_name])
        # Mode切り替え
        bpy.ops.object.mode_set(mode='OBJECT')
        bpy.ops.object.mode_set(mode='EDIT')
        bpy.ops.mesh.select_mode(type='EDGE')
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[
                33, 35, 36, 52, 53, 61, 62, 63, 64, 65, 66, 87, 90, 99, 102, 111, 118, 119, 128, 129, 138, 145, 146
            , 147, 154, 155, 156, 157, 168, 169, 170, 180, 193, 194, 195, 208, 209, 210, 211, 233, 236, 239, 242, 244
            , 245, 249, 262, 264, 265, 302, 305, 307, 310, 311, 313, 314, 318, 319, 321, 346, 348, 349, 351, 352, 354
            , 355, 357, 358, 362, 363, 365, 367, 370, 372, 374, 375, 376, 377, 378, 379, 380, 410, 413, 414, 416, 418
            , 422, 424, 425, 429, 431, 443, 444, 459, 462, 465, 467, 470, 474, 475, 477, 482, 486, 496, 500, 502, 506
            , 507, 509, 510, 511, 512, 514, 515, 518, 519, 557, 559, 560, 562, 563, 565, 566, 567, 568, 569, 572, 573
            , 574, 575, 578, 579, 580, 581, 616, 618, 619, 621, 624, 625, 626, 628, 629, 630, 631, 633, 636, 638, 639
            , 756, 759, 761, 764, 765, 767, 768, 772, 773, 777, 778, 782, 783, 787, 788, 792, 793, 797, 798, 800, 801
            , 805, 806, 808, 809, 811, 812, 814, 815, 817, 818, 820, 821, 823, 824, 826, 827, 829, 830, 832, 833, 835
            , 836, 838, 839, 841, 842, 844, 845, 847, 851, 853, 857, 860, 863, 864, 866, 871, 874, 877, 880, 882, 884
            , 912, 915, 918, 920, 921, 924, 928, 930, 931, 934, 937, 997, 1000, 1001, 1003, 1004, 1006, 1008, 1012, 1014
            , 1027, 1031, 1032, 1034, 1036, 1039, 1040, 1042, 1043, 1045, 1047, 1048, 1050, 1051, 1053, 1056, 1058, 1059
            , 1060, 1062, 1065, 1066, 1068, 1069, 1071, 1078, 1080, 1081, 1083, 1116, 1118, 1119, 1121, 1122, 1124, 1126
            , 1127, 1128, 1129, 1130, 1132, 1133, 1134, 1136, 1137, 1138, 1139, 1231, 1233, 1234, 1236, 1237, 1239, 1240
            , 1242, 1243, 1245, 1246, 1248, 1249, 1251, 1252, 1254, 1255, 1257, 1258, 1260, 1261, 1263, 1265, 1268, 1270
            , 1273, 1274, 1276, 1277, 1279, 1281, 1282, 1285, 1288, 1291, 1295, 1296, 1299, 1462, 1464, 1465, 1467, 1468
            , 1470, 1471, 1473, 1474, 1476, 1477, 1479, 1480, 1482, 1483, 1485, 1486, 1488, 1489, 1491, 1492, 1494, 1495
            , 1497, 1498, 1500, 1501, 1503, 1504, 1506, 1507, 1509, 1510, 1512, 1514, 1517, 1518, 1520, 1521, 1523, 1524
            , 1526, 1527, 1531, 1532, 1534, 1535, 1537, 1538, 1540, 1541, 1542, 1544, 1546, 1548, 1550, 1553, 1554, 1557
            , 1560, 1562, 1567, 1569, 1571, 1573
            , 437, 436, 386, 387, 886, 887, 944, 943
            , 1217, 1220, 49, 55
            , 658, 661, 668, 671, 648, 651, 91, 93
            , 50, 85, 395, 398, 447, 450
            , 38, 84, 32, 80
            , 18, 47, 42, 37, 39, 83
            , 41, 40, 26, 24
            , 16, 79, 51, 86
            , 25, 82
            , 27, 48
            ]
        ,   select_mode="EDGE"
        ,   object_name_list=[obj_name]
        )
        # # エッジループを選択
        # # ループ選択(Alt+Click) / 一周選択
        # bpy.ops.mesh.loop_multi_select(ring=False)

        # シームをマーク
        bpy.ops.mesh.mark_seam(clear=False)

        # ----------------------------------
        # UV展開
        # ----------------------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=["all"]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # UV 展開
        bpy.ops.uv.unwrap(method='ANGLE_BASED', margin=0)
        # bpy.ops.uv.smart_project(angle_limit=math.radians(89))
        # UV Editor内のすべてのUVを選択
        bpy.ops.uv.select_all(action='SELECT')
        # UVの回転を揃える
        bpy.ops.uv.align_rotation()
        # アイランドのスケールを平均化
        bpy.ops.uv.average_islands_scale()
        # アイランドをパックして整理
        bpy.ops.uv.pack_islands(rotate=True, margin=0.02) # margin Bake向け 0.01, Default: 0.001
        # UV展開後にストレッチを最小化
        bpy.ops.uv.minimize_stretch()

        # ----------------------------------
        # ベースマテリアル追加
        # ----------------------------------
        # アクティブオブジェクト
        mdl_cm_lib.active_object_select(object_name_list=[obj_name])
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_BASE)
        # -----------------------
        # 黒
        # -----------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[0, 1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 16, 17, 19, 20, 21, 22, 23, 24, 25, 27, 28, 29, 30
                          , 31, 32, 33, 35, 37, 38, 39, 40, 41, 42, 44, 47, 48, 49, 50, 51, 52, 53, 54, 56, 57, 58, 60, 62
                          , 63, 64, 67, 68, 69, 70, 72, 73, 74, 75, 79, 80, 81, 82, 83, 85, 86, 87, 92, 97, 98, 99, 101, 102
                          , 103, 105, 106, 107, 109, 110, 113, 115, 118, 120, 123, 125, 126, 128, 130, 131, 133, 134, 138, 140
                          , 146, 148, 153, 154, 156, 157, 160, 164, 165, 168, 171, 172, 175, 177, 181, 182, 191, 194, 197, 203
                          , 205, 207, 209, 212, 215, 216, 217, 218, 220, 222, 224, 225, 227, 232, 235, 236, 237, 238, 239, 245
                          , 246, 248, 249, 251, 252, 253, 254, 255, 256, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268
                          , 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289
                          , 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309
                          , 310, 311, 312, 313, 314, 315, 316, 317, 318, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330
                          , 331, 332, 333, 334, 335, 336, 337, 339, 340, 341, 342, 344, 345, 347, 348, 350, 351, 352, 353, 354
                          , 355, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376
                          , 378, 379, 380, 381, 382, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400
                          , 401, 402, 403, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421
                          , 422, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442
                          , 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462
                          , 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482
                          , 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502
                          , 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 514, 515, 516, 517, 519, 520, 521, 522, 523, 524
                          , 526, 527, 528, 530, 531, 533, 534, 535, 536, 537, 539, 541, 542, 543, 544, 546, 547, 548, 549, 550
                          , 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570
                          , 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590
                          , 591, 592, 593, 594, 595, 596, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611
                          , 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631
                          , 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651
                          , 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671
                          , 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691
                          , 692, 693, 694, 695, 696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711
                          , 712, 713, 714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727, 728, 729, 730, 731
                          , 732, 733, 734, 735, 736, 737, 738, 739, 740, 741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751
                          , 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 770, 771
                          , 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 784, 785]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_BLACK)
        # ベース色変更
        mtal_cm_lib.node_value_change(
            material_name=glb.glb_defs.MT_SUKIMA_LOGO_BLACK
        ,   node_name="Principled BSDF"
        ,   element_name="Base Color"
        ,   set_value=mtal_cm_lib.hex_to_rgba(hex_color="#000000", alpha=1.0)
        )
        # -----------------------
        # オレンジ
        # -----------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[76, 77, 89, 96, 100, 119, 121, 122, 141, 143, 144, 147, 152, 155, 159, 169, 176, 185, 187, 192, 198, 199
                          , 200, 213, 214, 223, 230, 233, 241, 257, 269, 356, 357, 529, 545]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_ORANGE)
        # ベース色変更
        mtal_cm_lib.node_value_change(
            material_name=glb.glb_defs.MT_SUKIMA_LOGO_ORANGE
        ,   node_name="Principled BSDF"
        ,   element_name="Base Color"
        ,   set_value=mtal_cm_lib.hex_to_rgba(hex_color="#ed5b00", alpha=1.0)
        )
        # -----------------------
        # 灰色
        # -----------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[26, 36, 43, 61, 65, 84, 88, 90, 95, 112, 142, 150, 158, 163, 178, 180, 183, 189, 201, 221, 226, 231, 247, 319, 349, 385, 532, 597]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_GRAY)
        # ベース色変更
        mtal_cm_lib.node_value_change(
            material_name=glb.glb_defs.MT_SUKIMA_LOGO_GRAY
        ,   node_name="Principled BSDF"
        ,   element_name="Base Color"
        ,   set_value=mtal_cm_lib.hex_to_rgba(hex_color="#919191", alpha=1.0)
        )
        # -----------------------
        # 黄緑
        # -----------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[9, 14, 18, 34, 45, 46, 93, 94, 108, 111, 114, 116, 124, 137, 139, 145, 149, 161, 162, 166, 170, 173, 174, 179, 184, 188
                          , 193, 195, 196, 208, 210, 211, 234, 242, 346, 383, 384, 423, 518, 525, 786
                          , 132, 129, 135]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_LIGHT_GREEN)
        # ベース色変更
        mtal_cm_lib.node_value_change(
            material_name=glb.glb_defs.MT_SUKIMA_LOGO_LIGHT_GREEN
        ,   node_name="Principled BSDF"
        ,   element_name="Base Color"
        ,   set_value=mtal_cm_lib.hex_to_rgba(hex_color="#50d875", alpha=1.0)
        )
        # -----------------------
        # 緑
        # -----------------------
        # 要素選択
        mdl_cm_lib.element_select(
            element_list=[15, 55, 59, 66, 71, 78, 91, 104, 117, 127, 136, 151, 167, 186, 190, 202, 204, 206, 219, 228, 229, 240, 243, 244, 250, 338, 343, 377, 404, 513, 538, 540]
        ,   select_mode="FACE"
        ,   object_name_list=[obj_name]
        )
        # マテリアル追加
        mtal_cm_lib.add_new_material(material_name=glb.glb_defs.MT_SUKIMA_LOGO_GREEN)
        # ベース色変更
        mtal_cm_lib.node_value_change(
            material_name=glb.glb_defs.MT_SUKIMA_LOGO_GREEN
        ,   node_name="Principled BSDF"
        ,   element_name="Base Color"
        ,   set_value=mtal_cm_lib.hex_to_rgba(hex_color="#199f93", alpha=1.0)
        )

        # # ビューへ切り替え
        # mdl_cm_lib.change_preview(key="SOLID")



